// App6.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include <iostream>
#include <stdio.h>
int main()
{
    setlocale(LC_ALL, "Russian");
    int x = 0,sr;
    float a, x_sum=0;
    printf("Введите пять оценок по программированию по 5-балльной шкале\n");
    for (int i = 0; i < 5; i++) {
        while (x < 2 || x>5) {
            printf("Введите оценку\n");
            scanf_s("%d", &x);
        }
        x_sum += x;
        x = 0;
    }
    sr = round(x_sum/5);
    switch (sr) {
    case 5: printf("отлично"); break;
    case 4: printf("хорошо"); break;
    case 3: printf("удовлетворительно"); break;
    case 2: printf("неудовлетворительно"); break;
    }
}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
